gin163/load_test_result.txt
./load_test.sh
ENDPOINT: http://127.0.0.1:8080/helloWorld
==> Simple request
HTTP/1.1 200 OK
Content-Length: 11
Content-Type: text/plain; charset=utf-8
Date: Wed, 03 Jun 2020 09:00:35 GMT

Request # 1

==> First load

Summary:
  Total:    2.3507 secs
  Slowest:  0.0254 secs
  Fastest:  0.0001 secs
  Average:  0.0023 secs
  Requests/sec: 42539.8100

  Total data:   1488900 bytes
  Size/request: 14 bytes

Response time histogram:
  0.000 [1] |
  0.003 [65592] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.005 [26809] |■■■■■■■■■■■■■■■■
  0.008 [5710]  |■■■
  0.010 [1398]  |■
  0.013 [357]   |
  0.015 [89]    |
  0.018 [25]    |
  0.020 [9] |
  0.023 [6] |
  0.025 [4] |


Latency distribution:
  10% in 0.0001 secs
  25% in 0.0004 secs
  50% in 0.0022 secs
  75% in 0.0031 secs
  90% in 0.0046 secs
  95% in 0.0059 secs
  99% in 0.0089 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0001 secs, 0.0254 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0042 secs
  resp wait:    0.0022 secs, 0.0000 secs, 0.0253 secs
  resp read:    0.0000 secs, 0.0000 secs, 0.0043 secs

Status code distribution:
  [200] 100000 responses



==> Second request

Summary:
  Total:    2.3133 secs
  Slowest:  0.0292 secs
  Fastest:  0.0001 secs
  Average:  0.0023 secs
  Requests/sec: 43228.3857

  Total data:   1600000 bytes
  Size/request: 16 bytes

Response time histogram:
  0.000 [1] |
  0.003 [75198] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.006 [19760] |■■■■■■■■■■■
  0.009 [4007]  |■■
  0.012 [720]   |
  0.015 [204]   |
  0.018 [79]    |
  0.020 [17]    |
  0.023 [7] |
  0.026 [4] |
  0.029 [3] |


Latency distribution:
  10% in 0.0002 secs
  25% in 0.0003 secs
  50% in 0.0021 secs
  75% in 0.0030 secs
  90% in 0.0046 secs
  95% in 0.0059 secs
  99% in 0.0089 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0001 secs, 0.0292 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0024 secs
  resp wait:    0.0022 secs, 0.0000 secs, 0.0242 secs
  resp read:    0.0000 secs, 0.0000 secs, 0.0025 secs

Status code distribution:
  [200] 100000 responses



==> Third request

Summary:
  Total:    2.3175 secs
  Slowest:  0.0264 secs
  Fastest:  0.0001 secs
  Average:  0.0023 secs
  Requests/sec: 43149.9319

  Total data:   1600000 bytes
  Size/request: 16 bytes

Response time histogram:
  0.000 [1] |
  0.003 [70405] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.005 [22914] |■■■■■■■■■■■■■
  0.008 [5075]  |■■■
  0.011 [1148]  |■
  0.013 [272]   |
  0.016 [109]   |
  0.018 [47]    |
  0.021 [18]    |
  0.024 [9] |
  0.026 [2] |


Latency distribution:
  10% in 0.0002 secs
  25% in 0.0003 secs
  50% in 0.0021 secs
  75% in 0.0030 secs
  90% in 0.0046 secs
  95% in 0.0059 secs
  99% in 0.0089 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0001 secs, 0.0264 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0029 secs
  resp wait:    0.0022 secs, 0.0000 secs, 0.0263 secs
  resp read:    0.0000 secs, 0.0000 secs, 0.0027 secs

Status code distribution:
  [200] 100000 responses



==> hit it for 30s
Running 30s test @ http://127.0.0.1:8080/helloWorld
  10 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.77ms    3.45ms  87.35ms   92.19%
    Req/Sec     4.63k   799.53     7.57k    71.43%
  1382266 requests in 30.02s, 175.98MB read
Requests/sec:  46049.33
Transfer/sec:      5.86MB
==> Last simple request
HTTP/1.1 200 OK
Content-Length: 17
Content-Type: text/plain; charset=utf-8
Date: Wed, 03 Jun 2020 09:01:43 GMT

Request # 1682359

Total time in seconds: 68